tests/org.jboss.tools.bpel.ui.bot.test/messages/Simple_Correlation/Simple_Correlation_request_2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:hello>
         <ID>
            <id>999</id>
         </ID>
         <Message>hi</Message>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>