tests/org.jboss.tools.bpel.ui.bot.test/projects/TrippleHello/messages/hello.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:hello>
         <ID>10</ID>
         <Name>BPEL</Name>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>
