tests/org.jboss.tools.bpel.ui.bot.test/messages/Hello_World_Header_WSDL_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cid="http://www.jboss.org/cid" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header>
      <cid:conversationId>666</cid:conversationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsdl:hello>
         <TestPart>Test</TestPart>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>